app/controllers/bots_controller.rb

def index
  if not Bot.all.empty?
    @bots = Bot.all

    @bots.each do |bot|
      bot.users.all.each do |user|
        if user.user.nil? || user.user.downcase == user.user
          next
        end
        if bot.users.where(:user => user.user.downcase)
          conflicting_user = bot.users.where(:user => user.user.downcase).first
          if not conflicting_user.nil?
            conflicting_user_name = conflicting_user.user
          else
            conflicting_user_name = "nil"
          end
          if bot.karmastats.where(:user_id => user.id)
            bot.karmastats.where(:user_id => user.id).each do |stat|
              if stat.total > 15
                Rails.logger.info "#{user.user} id: #{user.id} exists and conflicts with #{conflicting_user_name} for bot #{bot.nick} id: #{bot.id} with #{stat.total}"
                bot.users.all.each do |user_2|
                  if not user_2.nil?
                  if user_2.user.downcase == user.user.downcase && user_2.user != user.user
                    conflicting_stat = bot.karmastats.where(:user_id => user_2.id).first
                    if conflicting.stat.total < stat.total
                      conflicting_stat.update_attributes(:total => stat.total)
---
SELECT "bots".* FROM "bots" LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."user" = 'tim' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 56]]
SELECT "karmastats".* FROM "karmastats" WHERE "karmastats"."user_id" = 4 LIMIT 1
SELECT "bots".* FROM "bots" WHERE "bots"."id" = ? LIMIT 1  [["id", 3]]
SELECT "karmastats".* FROM "karmastats" WHERE ('t') ORDER BY rank ASC LIMIT 5
UPDATE "karmastats" SET "total" = -2, "updated_at" = '2013-12-13 14:52:45.967278' WHERE "karmastats"."id" = 1

def show
  @bot = Bot.find(params[:id])
---
SELECT "bots".* FROM "bots" WHERE "bots"."id" = ? LIMIT 1  [["id", "index"]]

def create
  @bot = Bot.new(bot_params)
  @bot.karma_timeout = 5
  if @bot.save
---
INSERT INTO "bots" ("channel", "created_at", "irc_file", "nick", "updated_at") VALUES (?, ?, ?, ?, ?)  [["channel", "#betabot"], ["created_at", Thu, 12 Dec 2013 22:31:30 UTC +00:00], ["irc_file", "swagbot.rb"], ["nick", "betabot"], ["updated_at", Thu, 12 Dec 2013 22:31:30 UTC +00:00]]

def destroy
  @bot = Bot.find(params[:id])
  if @bot.destroy
---
SELECT "bots".* FROM "bots" WHERE "bots"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "bots" WHERE "bots"."id" = ?  [["id", 2]]

def start
  @bot = Bot.find(params[:id])
---
SELECT "bots".* FROM "bots" WHERE "bots"."id" = ? LIMIT 1  [["id", "1"]]

def stop
  @bot = Bot.find(params[:id])
---
SELECT "bots".* FROM "bots" WHERE "bots"."id" = ? LIMIT 1  [["id", "3"]]

def restart
  @bot = Bot.find(params[:id])
---
SELECT "bots".* FROM "bots" WHERE "bots"."id" = ? LIMIT 1  [["id", "3"]]